
//ver1.7.5
//Author: Nishisonic

QUEST_LABELS = {
	214: // あ号作戦
		[
			["出撃:", "Sally214"],
			["S勝利:", "SWin214"],
			["ボス戦:", "Boss214"],
			["ボス勝利:", "BossWin214"]
		],
	626: // 精鋭「艦戦」隊の新編成
		[
			["96式:", "ScrapType96Fighter_626"],
			["21型:", "ScrapType0FighterModel21_626"],
		],
	643: // 主力「陸攻」の調達
		[
			["艦戦:", "ScrapType0FighterModel21_643"],
			["艦攻:", "Type97TorpedoBomber_643"],
			["陸攻:", "Type96LandBasedAttackAircraft_643"],
		],
	645: // 「洋上補給」物資の調達
		[
			["三式弾:", "ScrapType3Shell_645"],
			["徹甲弾:", "Type91AP_Shell_645"],
			["ﾄﾞﾗﾑ缶:", "DrumCanisters_645"],
			["燃料:", "DrumFuel_645",false],
			["弾薬:", "DrumAmmo_645",false],
		],
	663: // 新型艤装の継続研究
		[
			["廃棄:", "663"],
			["鋼材:", "Steel_663",false],
		],
	854: // 戦果拡張任務！「Z作戦」前段作戦
		[
			["2-4:", "854_2-4"],
			["6-1:", "854_6-1"],
			["6-3:", "854_6-3"],
			["6-4:", "854_6-4"],
		],
	426: // 海上通商航路の警戒を厳とせよ！
		[
			["警備:", "426_keibi"],
			["対潜:", "426_taisen"],
			["海上:", "426_kaijo"],
			["偵察:", "426_teisatsu"],
		],
	428: // 近海に侵入する敵潜を制圧せよ！
		[
			["対潜:", "428_taisen"],
			["海峡:", "428_kaikyo"],
			["長距離:", "428_keikai"],
		],
	674: // 工廠環境の整備
		[
			["機銃:", "674"],
			["鋼材:", "Steel_674",false],
		],
	873: // 北方海域警備を実施せよ！
		[
			["3-1:", "873_31"],
			["3-2:", "873_32"],
			["3-3:", "873_33"],
		],
	675: // 運用装備の統合整備
		[
			["艦戦:", "675_1"],
			["機銃:", "675_2"],
			["ﾎﾞｰｷ:", "675_3",false],
		],
	676: // 装備開発力の集中整備
		[
			["中口径:", "Mgun676"],
			["副砲:", "Sub676"],
			["ﾄﾞﾗﾑ缶:", "Drum676"],
			["鋼材:", "Steel676",false],
		],
	677: // 継戦支援能力の整備
		[
			["大口径:", "Lgun677"],
			["水上機:", "Plane677"],
			["魚雷:", "Torepdo677"],
			["鋼材:", "Steel677",false],
		],
	678: // 主力艦上戦闘機の更新
		[
			["96式:", "Scrap96_678"],
			["21式:", "Scrap21_678"],
			["ﾎﾞｰｷ:", "Bauxite678",false],
			["52型:", "Secretary678"],
		],
};
